test/non-functional/gatling/src/test/resources/bodies/GetCareContactsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:urn="urn:riv:itintegration:registry:1" 
                  xmlns:urn1="urn:riv:clinicalprocess:logistics:logistics:GetCareContactsResponder:2" 
                  xmlns:urn2="urn:riv:clinicalprocess:logistics:logistics:2">
   <soapenv:Header>
      <urn:LogicalAddress>VS-1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetCareContacts>
         <urn1:patientId>
            <urn2:id>${patientId}</urn2:id>
            <urn2:type>1.2.752.129.2.1.3.1</urn2:type>
         </urn1:patientId>
      </urn1:GetCareContacts>
   </soapenv:Body>
</soapenv:Envelope>